<template><div><!-- @format -->
<h1 id="为什么要写这个项目" tabindex="-1"><a class="header-anchor" href="#为什么要写这个项目"><span>为什么要写这个项目</span></a></h1>
<p>互联网行业，已经成为了一个红海行业，每天都有成千上万的人涌入这个行业，各种高学历的人、优秀的人、吃到红利的人，拿着这个行业头部的工资，头部的岗位。俨然成了寡头统治的行业。</p>
<p>打开，抖音、知乎、b 站，你会发现，哀鸿遍野， 无数人在下行的经济下，别说吃饭，甚至连汤都喝不到，失业裁员，充斥在各个角落。</p>
<p>互联网的戾气已经严重到，影响我们的判断， 我们不敢跳槽，不敢要求加薪， 不敢忤逆领导的意思，不敢去捍卫自己的权益。 因为我们害怕失业。</p>
<p>所有人，所有自媒体都在说，这年头能活下去，有份收入就不错了。 他们都在劝我们认命、安分、低头、忍耀。</p>
<p>如果，没有学历，没有大厂履历，没有光鲜的过去，就不要瞎折腾， 当好一个合格的牛马，</p>
<p>作为芸芸众生的我们，到底还有没有机会？</p>
<p>我是个小人物， 普通的履历，普通的成绩，普通的学历，普通的情商，普通的智商，普通的相貌，普通的人生，</p>
<p>凭着热爱，和努力，我高低要看看到底能不能在这个行业里，有一口饭吃！！</p>
<p>与上天掰掰手腕，大势不行，那么我们试着就把大势扶起来</p>
<p>我要把我的每一次复习，每一次经历，每一次的心得，都记录下来，分享给大家，希望能帮助到一些人，</p>
<p>当然最重要的是让大家重新燃起希望！告诉这个世界</p>
<p>只要努力准备，我们就还有机会！！</p>
<p>想这个操蛋的世界宣战，热爱可抵万难！！</p>
<!-- @format -->
</div></template>


